# SetObjectVariableLongInt

## Description
Sets the value of a VectorWorks object property. Used with properties requiring a LONGINT value.

For specific object selector index values, see the Script Appendix.

```pascal
PROCEDURE SetObjectVariableLongInt(
				h     : HANDLE;
				index : INTEGER;
				value : LONGINT);
```

```python
def vs.SetObjectVariableLongInt(h, index, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|
|index|INTEGER|Object property index.|
|value|LONGINT|New value for property.|

## Examples
#### VectorScript ####
```pascal
SetPref(17,FALSE);
```
#### Python ####
```python

```

```pascal
pioParentVPHand := GetVPGroupParent( GetParent( pioHand ) );
{ Set RW Background }
SetObjectVariableLongint( pioParentVPHand, 1006, Name2Index( GetName( pioRWBackRsrcHand ) ) );
```
```python
vs.SetObjectVariableLongInt(h, 1, value)
```

## Version
Availability: from VectorWorks9.0

## Category
* Object Info